Updated readme! fixed GUI
